[
  {
    "title": "Biden considering pre emptive pardons for Trump critics sources",
    "description": "President Biden is considering pre-emptive pardons for critics of Donald Trump, including figures like Dr. Anthony Fauci and Adam Schiff, to protect them from potential retribution if Trump takes office. This follows backlash over Biden's recent pardon of his son Hunter. Critics argue the pardons could send the wrong message, while others see them as necessary to shield political opponents from retaliation.",
    "videoId": "kgoKG4KgK5g"
  },
  {
    "title": "Trump’s Expanding Business Empire Raises Conflict Concerns",
    "description": "After spending $6.2 million on a banana and investing in a cryptocurrency firm, Justin Sun’s moves are raising red flags. His $30 million stake in World Liberty Financial links to Trump’s growing empire, triggering concerns over potential conflicts of interest. With ties to the crypto world, Trump could personally profit as his businesses expand, posing questions about ethics and influence in Washington.",
    "videoId": "xr38PfreuIY"
  },
  {
    "title": "Trump vows to end birthright citizenship and pardon rioters",
    "description": "President-elect Donald Trump, in a recent NBC interview, vowed to issue executive orders on immigration, energy, and the economy. He promised pardons for Capitol rioters, plans to end birthright citizenship, and deport undocumented immigrants. Trump also hinted at less support for Ukraine and proposed changes to Social Security, while distancing himself from investigations into political adversaries.",
    "videoId": "CwWiy_wk42A"
  },
  {
    "title": "Biden and Trump collaborate to secure Gaza ceasefire",
    "description": "The Biden administration is working with Trump’s incoming team to broker a ceasefire and secure the release of hostages in Gaza before Trump takes office in January. Despite their political differences, both sides are coordinating closely, aiming for a resolution. Key talks are ongoing, and while success isn’t guaranteed, officials remain hopeful of a breakthrough.",
    "videoId": "tqOx9MUbuBo"
  },
  {
    "title": "Trump calls Trudeau governor of Great State Canada",
    "description": "Donald Trump took a light jab at Prime Minister Justin Trudeau, calling him the 'governor' of the 'Great State of Canada' in a social media post. The comment followed a dinner at Trump’s Mar-a-Lago estate, where they discussed trade and tariffs. Despite Trump’s 25% tariff threat, Trudeau reassured Canadians, emphasizing a strategic response while ensuring cross-border trade remains strong between the US and Canada.",
    "videoId": "9mmhUxo7xII"
  },
  {
    "title": "FBI Director Christopher Wray to resign before Trump",
    "description": "FBI Director Christopher Wray announced he will resign before President-elect Donald Trump takes office. Wray, appointed by Trump in 2017, faced criticism over FBI investigations involving the former president. Trump has nominated Kash Patel, a staunch FBI critic, as the new director. Wray’s resignation follows months of tension and paves the way for a leadership change at the bureau.",
    "videoId": "0hLeMZJIVbQ"
  },
  {
    "title": "Trump Rings Bell as Stock Market Hits Record",
    "description": "President-elect Donald Trump rings the bell at the NYSE as stock markets soar to new highs. With the economy growing, unemployment low, and productivity up, investors are optimistic. However, challenges like inflation and potential policy disruptions raise concerns. While Trump promises tax cuts and deregulation, analysts caution that sustaining this growth could be difficult in the coming year.",
    "videoId": "1SFWLnfpO1I"
  },
  {
    "title": "Trump Ordered to Depose in Defamation Case Next Week",
    "description": "President-elect Donald Trump has been ordered to sit for a deposition next week in his defamation case against ABC News. The lawsuit stems from comments made by George Stephanopoulos, who claimed Trump was 'found liable for rape' in the E. Jean Carroll case. The judge has limited the deposition to four hours for both Trump and Stephanopoulos, with the case moving toward a potential summary judgment by December 24.",
    "videoId": "tvDdty0NLNs"
  },
  {
    "title": "US engages directly with Syria HTS rebels",
    "description": "US Secretary of State Antony Blinken confirms that the U.S. is in direct contact with the HTS rebels, who recently toppled the Assad regime in Syria. The discussions, especially regarding the fate of missing journalist Austin Tice, mark the first official US engagement with the group, designated as a terrorist organization. Amidst a turbulent transition, the US and regional powers stress the need for a peaceful, inclusive future for Syria.",
    "videoId": "XO3Y_M3Z-8U"
  },
  {
    "title": "FBI informants present at Capitol riot report reveals",
    "description": "On January 6, 2021, over two dozen FBI informants were in Washington, D.C. ahead of the Capitol riot, but no undercover agents participated. A recent Justice Department report revealed that while some informants entered the Capitol, none faced charges. The FBI was criticized for not using its field offices to gather more intelligence to prevent the riot. Over 1,500 individuals have been charged in connection with the attack.",
    "videoId": "dU5Wwsep6rA"
  }
]
